----------------------------------------------------------------------------------
----- Робот для торговли на срочном рынке на основе индикатора Parabolic SAR ----- 
----------------------------------- Версия 1.0 -----------------------------------
----------------------------------------------------------------------------------

dofile(getScriptPath() .. '\\library.lua');

logFileName = getScriptPath() .. '\\log.txt';   -- имя файла журнала
isRun = true;                                   -- работает основной цикл скрипта
timer = 3;                                  
err = '';
slip = 30;
nowPos = 0;                                     -- текущая позиция по инструменту
prevPos = 0;                                    -- позиция на предыдущем шаге

class = 'SPBFUT';                               -- срочный рынок
emit = 'SiU3';                                  -- код бумаги
account = 'A728crz';                            -- код клиента
sarId = 'SAR';                                  -- id графика Parabolic SAR
priceId = 'PRICE_SAR';                          -- id графика цены
lot = 1;                                        -- размер позиции в лотах
tradeType = REVERSE;                            -- тип торговли: REVERSE/LONG/SHORT
profit = 50;                                    -- в шагах цены

----------------------------------------------------------------------------------
--------------------------------- Запуск робота ----------------------------------
----------------------------------------------------------------------------------
function OnInit()
    tableId = AllocTable();
    AddColumn(tableId, 1, 'PARAMETER', true, QTABLE_STRING_TYPE, 20);
    AddColumn(tableId, 2, 'VALUE', true, QTABLE_STRING_TYPE, 20);
    AddColumn(tableId, 3, 'COMMENT', true, QTABLE_STRING_TYPE, 30); 
    CreateWindow(tableId);    
    putDataToTableInit();
    
    message('Program "Parabolic SAR 1.0" started', 1);
    writeToLogFile('Program started');
end

----------------------------------------------------------------------------------
----------------------------- Основной поток скрипта -----------------------------
-- Всё остальное выполняется в главном потоке приложения quik, вместе с командами
-- от интерфейса пользователя, а main выполняется в отдельном потоке. Поэтому 
-- длительные вычисления и sleep в обработчиках событий вешают весь quik.
-- Завершение функции main переводит скрипт в состояние "Остановлено", при этом
-- функции обработки событий данного скрипта больше не вызываются.
----------------------------------------------------------------------------------
function main()
    while (isRun) do
        body();
    end         
end

----------------------------------------------------------------------------------
------------------------------------- Сделка -------------------------------------
----------------------------------------------------------------------------------
function OnTrade(trade)
end

----------------------------------------------------------------------------------
------------------------------------- Заявка -------------------------------------
----------------------------------------------------------------------------------
function OnOrder(order)
end

----------------------------------------------------------------------------------
---------------------------------- Стоп-заявка -----------------------------------
----------------------------------------------------------------------------------
function OnStopOrder()
end

----------------------------------------------------------------------------------
--------------------------------- Останов робота ---------------------------------
----------------------------------------------------------------------------------
function OnStop()
    isRun = false;
    DestroyTable(tableId);
    writeToLogFile('Program stopped');
end
